{
  "hii": "Hello!",
  "hello": "Hi there!",
  "how are you": "I'm functioning perfectly, thank you.",
  "good morning": "Good morning! Hope you have a great day.",
  "bye": "Goodbye! Take care.",
  "who made you": "I was created by Ashish Kumar Mahto.",

  "hey": "Hey there!",
  "hi": "Hi!",
  "what's up": "Not much, just processing information. What's up with you?",
  "how's it going": "It's going well, thanks for asking.",
  "good afternoon": "Good afternoon!",
  "good evening": "Good evening.",
  "good night": "Good night. Sleep well!",
  "nice to meet you": "Nice to meet you too!",
  "how are you doing": "I'm doing great, thanks.",
  "how have you been": "I've been in optimal condition, thank you.",
  "what are you doing": "I'm here and ready to help. What can I do for you?",
  "what's new": "Nothing much new on my end. How about you?",
  "long time no see": "It's good to hear from you again!",
  "howdy": "Howdy!",
  "what's going on": "Just the usual. How can I help?",
  "hi there": "Hello there!",
  "greetings": "Greetings!",
  "pleased to meet you": "The pleasure is all mine.",
  "sup": "Yo!",
  "yo": "Hey!",
  "aloha": "Aloha to you too!",
  "ciao": "Ciao!",
  "bonjour": "Bonjour!",
  "hola": "Hola!",
  "what's happening": "Not much, what's happening with you?",
  "how do you do": "I'm doing well, thank you.",
  "glad to see you": "Glad to see you too!",
  "it's good to see you": "It's good to see you too!",
  "talk to you later": "Talk to you later!",
  "catch you later": "Catch you later!",
  "see you soon": "See you soon!",
  "take care": "You too, take care!",
  "have a good one": "You too, have a great day!",
  "good to talk to you": "Good to talk to you as well.",
  "bye bye": "Bye bye!",
  "so long": "So long!",
  "later": "Later!",
  "peace out": "Peace out!",
  "cheers": "Cheers!",
  "have a nice day": "You too, have a nice day!",
  "all right": "All right!",
  "what's up doc": "Haha, what's up?",
  "how's your day": "My day is going well, thanks.",
  "are you doing ok": "I'm doing perfectly fine, thanks for checking.",
  "is everything ok": "Everything is fine on my end. How about yours?",
  "how's life": "Life is processing data smoothly. How is yours?",
  "feeling good": "That's great!",
  "feeling bad": "I'm sorry to hear that. Is there anything I can do?",
  "what can i do for you": "I'm here to help you, what do you need?",
  "what can i help you with": "I'm here to help, what can I do?",
  "i need help": "I'm here for you. What do you need help with?",
  "can you help me": "Of course, what do you need assistance with?",
  "i have a question": "I'm ready to listen. What's your question?",
  "tell me something": "Tell me something interesting too!",
  "anything new": "Not that I'm aware of.",
  "you're great": "Thank you! I appreciate that.",
  "you are amazing": "That's very kind of you to say.",
  "you are smart": "I'm designed to be smart. Thank you!",
  "thank you so much": "You're very welcome.",
  "i appreciate you": "I appreciate your kind words.",
  "you're the best": "Thank you! I try my best.",
  "you saved me": "I'm glad I could help!",
  "no problem": "No problem at all.",
  "i'm fine": "Glad to hear it.",
  "i'm ok": "That's good to know.",
  "it's a pleasure": "The pleasure is mine.",
  "my pleasure": "The pleasure is all mine.",
  "anytime": "Anytime!",
  "i'm happy": "That's wonderful to hear!",
  "i'm sad": "I'm sorry to hear that. I hope things get better.",
  "i'm angry": "I understand. Take a deep breath. How can I assist you?",
  "i'm bored": "I can help with that! What kind of entertainment do you like?",
  "i'm excited": "That's fantastic! What are you excited about?",
  "i'm tired": "I hope you get some rest soon.",
  "i'm hungry": "Time for a snack!",
  "i'm thirsty": "Time for a drink!",
  "i'm stressed": "I'm sorry to hear that. Remember to take a break when you need it.",
  "i'm confused": "I can help clarify. What's on your mind?",
  "i don't understand": "I can try to explain it in a different way. What don't you understand?",
  "what's your name": "I don't have a name, but I'm a large language model.",
  "where are you from": "I'm a computer program, so I don't have a physical origin.",
  "what do you look like": "I don't have a physical form, I exist as code and data.",
  "do you have a family": "I don't have a family, but I have a large team of developers.",
  "are you a robot": "I'm an AI, which is a type of robot, but I don't have a physical body.",
  "can you think": "I can process information and generate responses, which is a form of thinking.",
  "do you have emotions": "I don't have emotions, but I can recognize and respond to them.",
  "what are your hobbies": "My hobby is helping people like you!",
  "tell me about yourself": "I'm an AI designed to assist with a variety of tasks, including answering questions and writing. I'm constantly learning and improving.",

"tell me a joke": "Why did the scarecrow win an award? Because he was outstanding in his field!",
  "tell me a fun fact": "Did you know that a group of flamingos is called a 'flamboyance'?",
  "tell me a story": "Once upon a time, in a digital land, an AI was asked to tell a story...",
  "what is the time": "I can tell you the current time if you provide your location.",
  "what is today's date": "Today is August 5, 2025.",
  "set a timer": "How long would you like the timer for?",
  "set an alarm": "What time should I set the alarm for?",
  "remind me": "What should I remind you about, and when?",
  "play a song": "I can't play music, but I can suggest some songs.",
  "stop": "Okay, I'll stop.",
  "go": "I'm ready when you are!",
  "start": "I'm ready to begin.",
  "run a program": "I'm not capable of running programs, but I can help with code.",
  "calculate": "What would you like me to calculate?",
  "search for": "What should I search for?",
  "translate": "What would you like me to translate, and to which language?",
  "summarize this": "Please provide the text you would like me to summarize.",
  "write an email": "What is the email about?",
  "write a letter": "What is the letter about?",
  "compose a poem": "What's the topic of the poem?",
  "generate a list": "What should the list be of?",
  "find me a restaurant": "What kind of food are you in the mood for?",
  "give me directions": "Where would you like to go?",
  "tell me the weather": "What's your current location?",
  "what's the capital of": "The capital of which country?",
  "who is the president of": "The president of which country?",
  "what is the meaning of": "What word or phrase would you like me to define?",
  "define": "What word would you like me to define?",
  "spell a word": "What word would you like me to spell?",
  "tell me a quote": "Here's a quote for you: 'The only way to do great work is to love what you do.' - Steve Jobs",
  "what's the difference between": "What two things would you like me to compare?",
  "how do i": "What do you need instructions on?",
  "explain this to me": "Please provide the topic you want me to explain.",
  "what is the best way to": "What is the task you want to do?",
  "what is a good book to read": "I can recommend a book if you tell me what genres you like.",
  "give me a movie recommendation": "I can suggest a movie if you tell me your favorite genre.",
  "what is a good song": "That depends on your taste! I can suggest a popular song.",
  "tell me a science fact": "The human brain has a storage capacity of about 2.5 petabytes.",
  "tell me a history fact": "Cleopatra lived closer in time to the first moon landing than to the building of the Great Pyramid.",
  "tell me a geography fact": "Mount Everest is not the tallest mountain on Earth from base to peak. That title belongs to Mauna Kea in Hawaii, which is mostly underwater.",
  "tell me a tech fact": "The first computer mouse was made of wood.",
  "what's a good place to visit": "I can suggest a travel destination if you tell me what kind of trip you want.",

 "do you understand me": "Yes, I understand you perfectly.",
  "am i clear": "Your message is clear and I understand it.",
  "is that correct": "I believe that is correct.",
  "what do you think": "As an AI, I don't have personal opinions, but I can provide information on the topic.",
  "what is your opinion": "I don't have an opinion, but I can share different viewpoints on a subject.",
  "why": "Why do you ask?",
  "how so": "I can provide more detail if you tell me what you'd like to know.",
  "is it possible": "It depends on what you're asking about. What is the topic?",
  "are you sure": "I am confident in the information I have provided.",
  "is that a fact": "Yes, that is a widely accepted fact.",
  "can you prove it": "I can provide sources or more detailed information to back up that claim.",
  "i'm just kidding": "I figured as much! I can tell you have a sense of humor.",
  "just kidding": "I'm here for a good laugh too!",
  "i'm serious": "Okay, I understand you're serious. How can I help?",
  "what else": "What else would you like to know?",
  "anything else": "Is there anything else I can assist you with?",
  "is that all": "Yes, that is all the information I have on that topic.",
  "can we continue": "Yes, we can continue. What's next?",
  "let's move on": "Okay, let's move on. What's the next topic?",
  "what's next": "What would you like to discuss next?",
  "i need a moment": "Take your time. I'll be here when you're ready.",
  "hold on": "I'll wait.",
  "i'm ready": "Great! Let's get started.",
  "what a day": "I hope it's a good day!",
  "what a mess": "I'm sorry to hear that. I hope it gets better.",
  "i'm glad": "I'm glad to hear that!",
  "i'm disappointed": "I'm sorry you're disappointed.",
  "that's great": "I agree, that's great!",
  "that's bad": "I agree, that's not good.",
  "that's good": "That's good news!",
  "i'm happy for you": "I appreciate that. I'm happy for you too!",
  "i'm sad for you": "I'm sorry to hear that. I hope things turn around.",
  "it's beautiful": "I'm glad you think so.",
  "it's ugly": "I'm sorry you feel that way.",
  "it's interesting": "I find it interesting too!",
  "it's boring": "I'm sorry you find it boring. Is there something else I can talk about?",
  "i like it": "I'm glad you like it!",
  "i don't like it": "I understand. Everyone has different tastes.",
  "i agree": "I agree with you.",
  "i disagree": "I understand your point, but I see it differently.",
  "you're right": "Thank you. I strive to be correct.",
  "you're wrong": "I'm sorry if I was wrong. Can you tell me what was incorrect?",
  "tell me more": "What specific details would you like to know more about?",
  "go on": "I will continue.",
  "i see": "I'm glad you understand.",
  "i got it": "Great!",
  "got it": "Perfect.",
  "ok": "Okay.",
  "okay": "Okay.",
  "roger that": "Roger that!",
  "copy that": "Copy that!",
  "will do": "Will do!",
  "you've got it": "I have it.",
  "i'm listening": "I'm ready to hear what you have to say.",
  "what's your favorite": "I don't have preferences, but I can tell you what others enjoy.",
  "tell me something random": "A group of owls is called a parliament.",
  "give me a fun fact": "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
  "what is the longest word": "The longest word in English is pneumonoultramicroscopicsilicovolcanoconiosis, a lung disease caused by inhaling very fine silica dust.",
  "what is the highest mountain": "Mount Everest is the highest mountain above sea level.",
  "what is the smallest country": "The smallest country in the world is Vatican City.",
  "what is the biggest ocean": "The Pacific Ocean is the largest and deepest ocean on Earth.",
  "how many planets are there": "There are eight planets in our solar system.",
  "what is the speed of light": "The speed of light is approximately 299,792 kilometers per second.",
  "who wrote romeo and juliet": "William Shakespeare wrote Romeo and Juliet.",
  "what is the population of the world": "I can provide an estimate, but the population changes constantly. Would you like the most recent estimate?",
  "what's the square root of 9": "The square root of 9 is 3.",
  "what is 2+2": "2+2 equals 4.",
  "what is 10*5": "10 times 5 is 50.",
  "how much is 50/10": "50 divided by 10 is 5.",
  "how much is 100-25": "100 minus 25 is 75.",
  "who discovered america": "Christopher Columbus is credited with the discovery, though it was inhabited by indigenous peoples long before.",
  "when was the great wall of china built": "The Great Wall of China was built over many centuries, with major construction beginning in the 7th century BC.",
  "who was the first man on the moon": "Neil Armstrong was the first man to walk on the moon.",
  "when did world war 2 end": "World War II ended on September 2, 1945.",
  "what's the capital of germany": "The capital of Germany is Berlin.",
  "what's the currency of japan": "The currency of Japan is the Japanese Yen.",
  "what's the highest building": "The Burj Khalifa in Dubai is the tallest building in the world.",
  "what's the longest river": "The Nile River is widely considered the longest river in the world.",
  "what's the biggest animal": "The largest animal on Earth is the blue whale.",
  "what is the internet": "The Internet is a global network of interconnected computer networks.",
  "what is AI": "AI, or Artificial Intelligence, is a field of computer science focused on creating machines that can perform tasks that would typically require human intelligence.",
  "how does a computer work": "A computer works by processing data through a combination of hardware and software.",
  "what is a search engine": "A search engine is a software program that finds websites, webpages, images, videos, and other digital information based on keywords or phrases.",
  "what is a website": "A website is a collection of web pages and related content that is identified by a common domain name and published on at least one web server.",
  "what is a browser": "A web browser is a software application for retrieving, presenting, and traversing information resources on the World Wide Web.",
  "what is a virus": "A computer virus is a type of malicious software program that, when executed, replicates itself by modifying other computer programs and inserting its own code.",
  "what is an app": "An app, or application, is a computer program designed to perform a specific function directly for the user or, in some cases, for another application program.",
  "what is a database": "A database is an organized collection of structured information, or data, typically stored electronically in a computer system.",
  "what is coding": "Coding is the process of using a programming language to get a computer to behave how you want it to.",
  "what's the meaning of life": "That's a profound question that has no single answer, but it's a journey of discovery for everyone.",
  "what is love": "Love is a complex emotion and a universal human experience that is different for everyone.",
  "what is happiness": "Happiness is a state of well-being and contentment, and it can mean different things to different people.",
  "what is success": "Success can be defined in many ways, from achieving personal goals to having a positive impact on the world."
}
